# HooksAndEndTreatmentAtTheSameEnd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..HooksAndEndTreatmentAtTheSameEnd Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Cannot add hooks and end treatments at the same end.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HooksAndEndTreatmentAtTheSameEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HooksAndEndTreatmentAtTheSameEnd As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HooksAndEndTreatmentAtTheSameEnd {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace